## Plan Result (prod-shutter)




<pre><code>Plan: 40 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;plum&#34;]
  * module.shutter.azurerm_cdn_profile.main[&#34;cnp&#34;]
  * module.shutter.azurerm_storage_account.shutter_store[&#34;plum&#34;]
  * module.shutter.azurerm_template_deployment.custom_domain[&#34;cft-api-mgmt&#34;]
  * module.shutter.azurerm_template_deployment.custom_domain[&#34;plum&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;adoption&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;cft-api-mgmt&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;cmc&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;cmc-legal&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;div-amend&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;div-da&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;div-dn&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;div-pfe&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;div-rfe&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;fact&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;fact-admin&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;fees-register&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;gateway-ccd&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;hmi-apim&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;ia-aip&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;idam-user-dashboard&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;idam-web-admin&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;idam-web-public&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;lau&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;manage-payments&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;nfdiv-civil-partnership&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;paybubble&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;payment-outcome&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;pcq&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;plum&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;probate&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;reformscan&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;return-case-doc-ccd&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;sscs-cor&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;sscs-tribunals&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;sscs-tya&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;xui-approve-org&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;xui-manage-org&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;xui-register-org&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;xui-webapp&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["plum"] will be created
  + resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      + content_types_to_compress     = (known after apply)
      + fqdn                          = (known after apply)
      + id                            = (known after apply)
      + is_compression_enabled        = false
      + is_http_allowed               = false
      + is_https_allowed              = true
      + location                      = "westus"
      + name                          = "hmcts-plum-shutter-prod"
      + origin_host_header            = (known after apply)
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
      + profile_name                  = "hmcts-shutter-cnp"
      + querystring_caching_behaviour = "IgnoreQueryString"
      + resource_group_name           = "shutter-app-prod-rg"
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + origin {
          + host_name  = (known after apply)
          + http_port  = 80
          + https_port = 443
          + name       = (known after apply)
        }
    }

  # module.shutter.azurerm_cdn_profile.main["cnp"] will be created
  + resource "azurerm_cdn_profile" "main" {
      + id                  = (known after apply)
      + location            = "westus"
      + name                = "hmcts-shutter-cnp"
      + resource_group_name = "shutter-app-prod-rg"
      + sku                 = "Standard_Verizon"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.shutter.azurerm_storage_account.shutter_store["plum"] will be created
  + resource "azurerm_storage_account" "shutter_store" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "RAGRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_0"
      + name                              = "hmctsplumshutterprod"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "shutter-app-prod-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + blob_properties {
          + change_feed_enabled      = (known after apply)
          + default_service_version  = (known after apply)
          + last_access_time_enabled = (known after apply)
          + versioning_enabled       = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }

      + static_website {
          + error_404_document = "index.html"
          + index_document     = "index.html"
        }
    }

  # module.shutter.azurerm_template_deployment.custom_domain["cft-api-mgmt"] will be created
  + resource "azurerm_template_deployment" "custom_domain" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "cft-api-mgmt"
      + outputs             = (known after apply)
      + parameters          = {
          + "hostName" = "cft-api-mgmt.platform.hmcts.net"
          + "name"     = "hmcts-shutter-cft-api-mgmt/hmcts-cft-api-mgmt-shutter-prod/cft-api-mgmt-platform-hmcts-net"
        }
      + resource_group_name = "shutter-app-prod-rg"
      + template_body       = jsonencode(
            {
              + "$schema"      = "http://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + hostName = {
                      + type = "string"
                    }
                  + name     = {
                      + type = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2019-04-15"
                      + name       = "[parameters('name')]"
                      + properties = "[variables('properties')]"
                      + type       = "microsoft.cdn/profiles/endpoints/customdomains"
                    },
                ]
              + variables      = {
                  + properties = {
                      + hostName = "[parameters('hostName')]"
                    }
                }
            }
        )
    }

  # module.shutter.azurerm_template_deployment.custom_domain["plum"] will be created
  + resource "azurerm_template_deployment" "custom_domain" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "plum"
      + outputs             = (known after apply)
      + parameters          = {
          + "hostName" = "plum.platform.hmcts.net"
          + "name"     = "hmcts-shutter-cnp/hmcts-plum-shutter-prod/plum-platform-hmcts-net"
        }
      + resource_group_name = "shutter-app-prod-rg"
      + template_body       = jsonencode(
            {
              + "$schema"      = "http://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + hostName = {
                      + type = "string"
                    }
                  + name     = {
                      + type = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2019-04-15"
                      + name       = "[parameters('name')]"
                      + properties = "[variables('properties')]"
                      + type       = "microsoft.cdn/profiles/endpoints/customdomains"
                    },
                ]
              + variables      = {
                  + properties = {
                      + hostName = "[parameters('hostName')]"
                    }
                }
            }
        )
    }

  # module.shutter.null_resource.enable_custom_https_cmd["adoption"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "7874eaab53684f53a621c03bb1001659"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["cft-api-mgmt"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "50f582aabf0a49858fa1c4b260700b58"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["cmc"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "0b258b4239ba47af980651a0ecabc416"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["cmc-legal"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "6c071f19c15b4ae4bb6df7f72c4863f4"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["div-amend"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "10f09b94a0b84636a205852144aff161"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["div-da"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "897abb8a88094747b99e321f0c32d6f1"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["div-dn"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "1119221b36a24965b45426ccc1a21e1b"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["div-pfe"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "c6a19bdf57fe4db88e9d826b0bd3cd15"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["div-rfe"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "57bc6183888a46c6b02e3713ec06ec46"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["fact"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "5b28ef0d84354161a4662a40e192da84"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["fact-admin"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "5b28ef0d84354161a4662a40e192da84"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["fees-register"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "5c42e98e2dae4274a3f73d2d6fb37676"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["gateway-ccd"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "6013a7fecff24b42ab0504451ebb32e7"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["hmi-apim"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "50f582aabf0a49858fa1c4b260700b58"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["ia-aip"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "80699ccae2cf4824af11e743344e40ba"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["idam-user-dashboard"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "9cb90eb974c34f54a705c1230997d661"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["idam-web-admin"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "9e85820ee27c4770b02e03ff5d8e52c9"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["idam-web-public"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "49c798015b184ab7ab639da2655a254d"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["lau"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "3a6e89d76d574798ae33d669f324498b"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["manage-payments"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "2ae19edbcfc3431f9bebcaf0664ac19b"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["nfdiv-civil-partnership"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "e8c9837c5f674db0b56cdd52302311f8"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["paybubble"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "e4246908355046728df2b5b699d3b12f"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["payment-outcome"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "f0f8e8a27ee84a4aaf16b08915ff2a0e"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["pcq"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "280e313f45004bbe9af6fb77463ab602"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["plum"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "50f582aabf0a49858fa1c4b260700b58"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["probate"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "7e917aeb49924b4c8519c29eadd95c9f"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["reformscan"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "50f582aabf0a49858fa1c4b260700b58"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["return-case-doc-ccd"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "6013a7fecff24b42ab0504451ebb32e7"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["sscs-cor"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "55ffe6cfa1474fbab01c7864c45f6351"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["sscs-tribunals"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "13f003754fb3478dbbdb5076b945709c"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["sscs-tya"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "d873408f97af40dfad3c8331da2c43c3"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["xui-approve-org"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "bcf2f9c7a08946f89c452fad6cf1d7a0"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["xui-manage-org"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "296f95b6347f41fba77a6ebdd740b941"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["xui-register-org"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "468bee682c564c17866f12a91dcd0330"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["xui-webapp"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "5f4d928cf16f40a59822c2ebe3810c46"
        }
    }

Plan: 40 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1238,"Program":"tfcmt","SHA1":"","Target":"prod-shutter","Vars":{}} -->